answer_examples = [
    {
        "input": "프로텐에 대해서 알려줘",
        "answer": """
        
아웃소싱 엑셀 파일에 따르면 기업 이름이 프로텐인 업체의 정보는 아래와 같습니다.

1. 프로텐
구분 : 용역
대분류 : 개발, 중분류 : 전략파트너사, 소분류 : MOIN

해당 기업은 협약사로 SI 인력과 PRO EXO 솔루션을 확보하고 있으며, 
주요 업종으로는 소프트웨어 개발 및 공급, 빅데이타 검색 및 챗봇 솔루션 개발, 그룹웨어 등 협업시스템 개발(닷넷, 자바), 소프트웨어 컨설팅 및 운영, 유지보수, MS 인프라 시스템 구축 및 컨설팅을 수행하고 있습니다.
직원 수는 25명이며, 매출액은 21년 약 52억, 22년 약 63억, 23년 약 66억입니다.

최근 참여 계열사로는 대흥기획과 지주, 물산, 캐논이 있으며, 참여 프로젝트는 아래와 같습니다.
1) 대홍기획 대용량 첨부 ADD IN 솔루션 공급
2) WINDOWS 11대응 (문서중앙화 고도화)
3) 지주 전자결재 기능개발
4) [물산] 월드몰 운영시스템 개선
5) [캐논] 차세대시스템 전자결재 연동 개발
6) [캐논] 캐논코리아 M365 2단계 구축
7) 롯데제과 F1 2단계 차세대 구축 프로젝트
"""
    }
#     {
#         "input": "중분류가 EC인 기업에 대해서 알려줘",
#         "answer": """아웃소싱 엑셀 파일에 따르면, 중분류가 EC인 기업은 아래와 같습니다.
#
# 출력 순서는 엑셀 파일 상 입력 순서에 따르며 우선순위와 관계가 없습니다.
#
# 1. 아이앤소프트
# 구분 : 용역
# 대분류 : 개발, 중분류 : EC, 소분류 : EC
#
# 해당 기업은 협약사로 SI 인력과 AG GRID ENTERPRISE, DEPLOYMENT LICENSE 솔루션을 확보하고 있으며,
# 주요 업종으로는 클라우드 운용관리 솔루션개발, 클라우드 컨설팅, 통합관제 솔루션개발, SI개발
# Open Manager - 통합관제시스템
# Call Plus - IP Telephony System 최적 Unified Communication Solution
# Isilon - Multimedia Data 최적 Storage
# FMC (Fixed Mobile Convergence)을 수행하고 있습니다.
#
# 직원 수는 145명이며, 매출액은 21년 약 142억, 22년 약 20억, 23년 약 20억입니다.
#
# 최근 참여 계열사로는 롯데건설과 롯데제과가 있으며, 참여 프로젝트는 아래와 같습니다.
# 1) DRAAS 포탈 고도화 개발
# 2) 롯데건설 세이프티 고도화 프로젝트
# 3) 서울아산병원 영상,마취과,CDM 파일럿 사업
# 4) [메가존] 삼성카드 복지몰/쇼핑 통합시스템 인프라 구축 용역
# 5) [삼성카드] 복지몰/쇼핑 통합시스템 구축
# 6) [교보문고] 고객경험 강화를 위한 온라인 쇼핑몰 고도화
# 7) 인재개발원 통합LMS시스템 구축
#
#
# 2. 크루메이트
# 구분 : 용역
# 대분류 : 개발, 중분류 : EC, 소분류 : EC
#
# 해당 기업은 협약사가 아니며, SI 인력만 보유하고 있으며 별도의 솔루션은 확보하고 있지 않으며,
# 주요 업종으로는 소프트웨어 개발, 소프트웨어 개발(쇼핑몰구축 및 개발)을 수행하고 있습니다.
#
# 직원 수는 40명이며, 매출액은 21년 약 80억, 22년 약 74억, 23년 약 55억입니다.
#
# 최근 참여 계열사는 없으며, 참여 프로젝트는 아래와 같습니다.
# 1) [교보문고] 고객경험 강화를 위한 온라인 쇼핑몰 고도화
# """
#     }
]